tks-projects/libs/librs/test_rs/org/literate.org.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.57 in css mode. -->
<html>
  <head>
    <title>literate.org</title>
  </head>
  <body>
    <pre>
<span class="org-drawer">:PROPERTIES:</span>
<span class="org-document-info-keyword">#+title:</span> <span class="org-document-title">literate programming test document
</span><span class="org-document-info-keyword">#+author:</span> <span class="org-document-info">bsp
</span>
A program is divided into <span class="org-code">~macro~</span> snippets, interwoven by documentation.

The macros are then tangled into an executable source (see <span class="org-link"><a href="*Define the tangled program structure">Define the tangled program structure</a></span>)

<span class="org-level-1">* </span><span class="org-level-1"><span class="org-special-keyword">COMMENT</span></span><span class="org-level-1"> execute code block under cursor with C-c C-c (org-babel-execute-src-block)</span>
<span class="org-level-1">* </span><span class="org-level-1"><span class="org-special-keyword">COMMENT</span></span><span class="org-level-1"> execute all code blocks with C-c C-v C-b OR C-x C-c (org-babel-execute-buffer)</span>
<span class="org-level-1">* </span><span class="org-level-1"><span class="org-special-keyword">COMMENT</span></span><span class="org-level-1"> the test_host saves the tangled source to "autogen_debug.tks"</span>
<span class="org-level-1">* </span><span class="org-level-1"><span class="org-special-keyword">COMMENT</span></span><span class="org-level-1"> macros may contain tangled snippets (default recursion depth = 20)</span>

See also: <span class="org-link"><a href="file:cellular.org">cellular programming</a></span>


<span class="org-hide">*</span><span class="org-level-2">* TKS-remote test host</span>
  * start <span class="org-code">~test_host~</span>
   Must done in a shell (editor hangs otherwise)
<span class="org-block-begin-line">   #+begin_src shell :results output replace :eval never
</span><span class="org-block">     </span><span class="org-block"><span class="comment-delimiter">#</span></span><span class="org-block"><span class="comment">!/bin/zsh
</span></span><span class="org-block">     </span><span class="org-block"><span class="comment-delimiter">#</span></span><span class="org-block"><span class="comment">setopt NO_HUP
</span></span><span class="org-block">     tks app:test_host &amp;</span><span class="org-block"><span class="negation-char">!</span></span><span class="org-block">
</span><span class="org-block-end-line">   #+end_src
</span><span class="org-meta-line">   #+results:</span>
   <span class="org-code">: 
</span>
<span class="org-hide">**</span><span class="org-level-3">* test 1 (live coding)</span>
   Connects to script host <span class="org-code">~test_host~</span> and evaluates some code in the context of the running host program.
   The host <span class="org-code">~MyAPI~</span> provides a few members and methods to play with.
<span class="org-block-begin-line">   #+begin_src tks-rs :host "test_host" :results output replace
</span><span class="org-block">     trace </span><span class="org-block"><span class="string">"hello, world."</span></span><span class="org-block">;
     trace </span><span class="org-block"><span class="string">"i="</span></span><span class="org-block">+MyAPI.i+</span><span class="org-block"><span class="string">" f="</span></span><span class="org-block">+MyAPI.f+</span><span class="org-block"><span class="string">" s=\""</span></span><span class="org-block">+MyAPI.s+</span><span class="org-block"><span class="string">"\""</span></span><span class="org-block">;
     trace </span><span class="org-block"><span class="string">"MyAPI.Add(23, 42)="</span></span><span class="org-block">+</span><span class="org-block"><span class="constant">MyAPI</span></span><span class="org-block">.Add(23, 42);
     trace </span><span class="org-block"><span class="string">"MyAPI.Add(1.23, 4.56)="</span></span><span class="org-block">+</span><span class="org-block"><span class="constant">MyAPI</span></span><span class="org-block">.Add(1.23, 4.56);
</span><span class="org-block-end-line">   #+end_src
</span><span class="org-meta-line">   #+results:</span>
   <span class="org-code">: hello, world.
</span>   <span class="org-code">: i=42 f=3.14159 s="mystring"
</span>   <span class="org-code">: MyAPI.Add(23, 42)=65
</span>   <span class="org-code">: MyAPI.Add(1.23, 4.56)=5.79
</span>
<span class="org-hide">**</span><span class="org-level-3">* test 2 (literate)</span>

<span class="org-hide">***</span><span class="org-level-4">* Define a string var</span>
<span class="org-block-begin-line">     #+begin_src tks-rs :host "test_host" :results output replace
</span><span class="org-block">       </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">string &lt;&lt;msg&gt;&gt;
</span></span><span class="org-block">       hello, </span><span class="org-block"><span class="string">"world"</span></span><span class="org-block">.
</span><span class="org-block-end-line">     #+end_src
</span><span class="org-meta-line">     #+results:</span>
     <span class="org-code">: 
</span>
<span class="org-hide">***</span><span class="org-level-4">* Define the program prologue</span>
<span class="org-block-begin-line">     #+begin_src tks-rs :host "test_host" :results output replace
</span><span class="org-block">       </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">macro &lt;&lt;init&gt;&gt;
</span></span><span class="org-block">       trace </span><span class="org-block"><span class="string">"calculating earth&lt;&gt;moon distance.."</span></span><span class="org-block">;
</span><span class="org-block-end-line">     #+end_src
</span><span class="org-meta-line">     #+results:</span>
     <span class="org-code">: 
</span>
<span class="org-hide">***</span><span class="org-level-4">* Define the program body</span>
<span class="org-block-begin-line">     #+begin_src tks-rs :host "test_host" :results output replace
</span><span class="org-block">       </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">macro &lt;&lt;body&gt;&gt;
</span></span><span class="org-block">       </span><span class="org-block"><span class="type">trace</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">msg</span></span><span class="org-block">;
</span><span class="org-block-end-line">     #+end_src
</span><span class="org-meta-line">     #+results:</span>
     <span class="org-code">: 
</span>
<span class="org-hide">***</span><span class="org-level-4">* Define the program epilogue</span>
<span class="org-block-begin-line">     #+begin_src tks-rs :host "test_host" :results output replace
</span><span class="org-block">       </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">macro &lt;&lt;exit&gt;&gt;
</span></span><span class="org-block">       trace </span><span class="org-block"><span class="string">"cu"</span></span><span class="org-block">;
</span><span class="org-block-end-line">     #+end_src
</span><span class="org-meta-line">     #+results:</span>
     <span class="org-code">: 
</span>
<span class="org-hide">***</span><span class="org-level-4">* Define the tangled program structure</span>
<span class="org-block-begin-line">     #+begin_src tks-rs :host "test_host" :results output replace
</span><span class="org-block">       trace </span><span class="org-block"><span class="string">"pre"</span></span><span class="org-block">;
       </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">tangle &lt;&lt;init&gt;&gt;
</span></span><span class="org-block">       </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">tangle &lt;&lt;body&gt;&gt;
</span></span><span class="org-block">       </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">tangle &lt;&lt;exit&gt;&gt;
</span></span><span class="org-block">       trace </span><span class="org-block"><span class="string">"post"</span></span><span class="org-block">;
</span><span class="org-block-end-line">     #+end_src
</span><span class="org-meta-line">     #+results:</span>
     <span class="org-code">: pre
</span>     <span class="org-code">: calculating earth&lt;&gt;moon distance..
</span>     <span class="org-code">: hello, "world".
</span>     <span class="org-code">: cu
</span>     <span class="org-code">: post
</span></pre>
  </body>
</html>
